In [1]:
%load_ext sql
%sql sqlite://
%sql PRAGMA busy_timeout = 30000;

Done.

[(30000,)]

In [2]:
%sql SELECT name from sqlite_master WHERE type = "table"

Done.

[]

In [3]:
%%sql
DROP TABLE IF EXISTS PRODUCT;
CREATE TABLE PRODUCT(
    PName VARCHAR(255) NOT NULL PRIMARY KEY,
    Price FLOAT,
    Category VARCHAR(255),
    Manufacturer VARCHAR(255)
);
INSERT INTO Product values('Grzmo', 19.99, 'Gadgets', 'Gizmo Works');
INSERT INTO Product values('Powergizmo', 29.99,'Gadgets', 'Gizmo Works');
INSERT INTO Product values('SingleTouch', 149.99, 'Photography', 'Camon');
INSERT INTO Product values('MultiTouch', 203.99,'Household', 'Hitachi');

Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [4]:
%sql SELECT name FROM sqlite_master Where type = 'table';

Done.

[('PRODUCT',)]

In [5]:
%sql SELECT sql FROM sqlite_master

Done.

[('CREATE TABLE PRODUCT(\n    PName VARCHAR(255) NOT NULL PRIMARY KEY,\n    Price FLOAT,\n    Category VARCHAR(255),\n    Manufacturer VARCHAR(255)\n)',),
 (None,)]

In [6]:
%%sql -- Without Where, the query returns all date in the table(s) defined in FROM
SELECT * FROM product;

Done.

[('Grzmo', 19.99, 'Gadgets', 'Gizmo Works'),
 ('Powergizmo', 29.99, 'Gadgets', 'Gizmo Works'),
 ('SingleTouch', 149.99, 'Photography', 'Camon'),
 ('MultiTouch', 203.99, 'Household', 'Hitachi')]

In [7]:
%sql SELECT * FROM product where category = 'Gadgets';

Done.

[('Grzmo', 19.99, 'Gadgets', 'Gizmo Works'),
 ('Powergizmo', 29.99, 'Gadgets', 'Gizmo Works')]

In [8]:
%sql SELECT * FROM Product;

Done.

[('Grzmo', 19.99, 'Gadgets', 'Gizmo Works'),
 ('Powergizmo', 29.99, 'Gadgets', 'Gizmo Works'),
 ('SingleTouch', 149.99, 'Photography', 'Camon'),
 ('MultiTouch', 203.99, 'Household', 'Hitachi')]

In [9]:
%sql SELECT * FROM product where price between 10 and 30;

Done.

[('Grzmo', 19.99, 'Gadgets', 'Gizmo Works'),
 ('Powergizmo', 29.99, 'Gadgets', 'Gizmo Works')]

In [10]:
%sql SELECT * FROM product WHERE PName LIKE '%ouch%';

Done.

[('SingleTouch', 149.99, 'Photography', 'Camon'),
 ('MultiTouch', 203.99, 'Household', 'Hitachi')]

In [11]:
%sql SELECT Category FROM Product;

Done.

[('Gadgets',), ('Gadgets',), ('Photography',), ('Household',)]

In [12]:
%sql SELECT DISTINCT Category FROM Product;

Done.

[('Gadgets',), ('Photography',), ('Household',)]

In [13]:
%sql SELECT * FROM product ORDer BY price DESC

Done.

[('MultiTouch', 203.99, 'Household', 'Hitachi'),
 ('SingleTouch', 149.99, 'Photography', 'Camon'),
 ('Powergizmo', 29.99, 'Gadgets', 'Gizmo Works'),
 ('Grzmo', 19.99, 'Gadgets', 'Gizmo Works')]

In [14]:
%%sql
CREATE TABLE Company(
    CName varchar(255) NOT NULL PRIMARY KEY,
    StockPrice FLOAT,
    Country varchar(255)
);

Done.

[]

In [15]:
%%sql
CREATE TABLE Purchase(
    id varchar(255) PRIMARY KEY,
    Product varchar(255) NOT NULL,
    buyer VARCHAR(255) NOT NULL,
    FOREIGN KEY (product) REFERENCES Product(PName)
);

Done.

[]

In [16]:
%%sql
INSERT INTO Company VALUES('GWorks', 25, 'USA');
INSERT INTO Company VALUES('Canon', 65, 'Japan');
INSERT INTO Company VALUES('Hitachi', 15, 'Japan');
INSERT INTO Company VALUES('IBM', 140, 'USA');

INSERT INTO Purchase VALUES (1, 'Gizmo', 'Joe Blow');
INSERT INTO Purchase VALUES (2, 'Gizmo', 'Joe Blow');
INSERT INTO Purchase VALUES (3, 'SingleTouch', 'Mr Smith');
INSERT INTO Purchase VALUES (4, 'MultiTouch', 'Mr Smith');
INSERT INTO Purchase VALUES (5, 'Gizmo', 'Mr Smith');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [17]:
%sql pragma table_info(Product);

Done.

[(0, 'PName', 'VARCHAR(255)', 1, None, 1),
 (1, 'Price', 'FLOAT', 0, None, 0),
 (2, 'Category', 'VARCHAR(255)', 0, None, 0),
 (3, 'Manufacturer', 'VARCHAR(255)', 0, None, 0)]

In [18]:
%sql pragma table_info(Purchase);

Done.

[(0, 'id', 'varchar(255)', 0, None, 1),
 (1, 'Product', 'varchar(255)', 1, None, 0),
 (2, 'buyer', 'VARCHAR(255)', 1, None, 0)]

In [19]:
%%sql -- Antoher set of tables

-- Create tables
DROP TABLE IF EXISTS P;
CREATE TABLE P (
    A INT
);

DROP TABLE IF EXISTS Q;
CREATE TABLE Q(
    B INT,
    C INT
);

-- Insert tuoleshh
INSERT INTO P VALUES(1);
INSERT INTO P VALUES(3);

INSERT INTO Q VALUES(2,3);
INSERT INTO Q VALUES(3,4);
INSERT INTO Q VALUES(3,5);

Done.
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [20]:
%sql SELECT name FROM sqlite_master where type = 'table';

Done.

[('PRODUCT',), ('Company',), ('Purchase',), ('P',), ('Q',)]

In [21]:
%%sql -- Product table
UPDATE Product SET Manufacturer = 'GWorks' WHERE Manufacturer = 'Gizmo Works';
SELECT * FROM Product;

Done.
Done.

[('Grzmo', 19.99, 'Gadgets', 'GWorks'),
 ('Powergizmo', 29.99, 'Gadgets', 'GWorks'),
 ('SingleTouch', 149.99, 'Photography', 'Camon'),
 ('MultiTouch', 203.99, 'Household', 'Hitachi')]

In [22]:
%%sql --Company Table
SELECT * FROM Company

Done.

[('GWorks', 25.0, 'USA'),
 ('Canon', 65.0, 'Japan'),
 ('Hitachi', 15.0, 'Japan'),
 ('IBM', 140.0, 'USA')]

In [23]:
%%sql
Select PName, Price FROM Product, Company WHERE Manufacturer = CName AND Country = 'Japan';

Done.

[('MultiTouch', 203.99)]

In [24]:
%%sql
SELECT PName, Price
FROM Product, COmpany
WHERE Manufacturer = CName
    AND Country = 'Japan'
    AND Price <= 200;

Done.

[]

In [25]:
%%sql
SELECT P.A
FROM P,Q
WHERE P.A = Q.B

Done.

[(3,), (3,)]

In [26]:
%%sql
Select Country
FROM Product, Company
WHERE Manufacturer = CName
    AND Category = 'Gadgets'

Done.

[('USA',), ('USA',)]

In [27]:
%%sql
SELECT * FROM product, company where Manufacturer = CName AND Category = 'Gadgets';

Done.

[('Grzmo', 19.99, 'Gadgets', 'GWorks', 'GWorks', 25.0, 'USA'),
 ('Powergizmo', 29.99, 'Gadgets', 'GWorks', 'GWorks', 25.0, 'USA')]

In [28]:
# Create tables & insert some numbers
%sql DROP TABLE IF EXISTS R;
%sql DROP TABLE IF EXISTS S;
%sql DROP TABLE IF EXISTS T;

%sql CREATE TABLE R (A INT);
%sql CREATE TABLE S (A INT);
%sql CREATE TABLE T (A INT);

for i in range(1,6):
    %sql INSERT INTO R VALUES(:i)

for i in range(1,10,2):
    %sql INSERT INTO S VALUES(:i)

for i in range(1,11,3):
    %sql INSERT INTO T VALUES(:i)

Done.
Done.
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

In [29]:
%%sql
SELECT R.A FROM R,S WHERE R.A = S.A
INTERSECT
SELECT R.A FROM R,T WHERE R.A = T.A;

Done.

[(1,)]

In [30]:
%%sql
SELECT R.A FROM R,S WHERE R.A = S.A
EXCEPT
SELECT R.A FROM R,T WHERE R.A = T.A;

Done.

[(3,), (5,)]

In [31]:
%sql SELECT * FROM Purchase;

Done.

[('1', 'Gizmo', 'Joe Blow'),
 ('2', 'Gizmo', 'Joe Blow'),
 ('3', 'SingleTouch', 'Mr Smith'),
 ('4', 'MultiTouch', 'Mr Smith'),
 ('5', 'Gizmo', 'Mr Smith')]

In [35]:
%%sql
SELECT c.country
FROM Company c
Where CName IN (Select pr.Manufacturer
               From Purchase p, Product pr
               WHERE p.product = pr.PName
               AND p.buyer = 'Joe Blow');

Done.

[]

In [38]:
%%sql
SELECT pr.Manufacturer
                  FROM Purchase p, Product pr
                  WHERE p.product = pr.PName
                        AND p.buyer = 'Joe Blow'

Done.

[]